app/controllers/articles_controller.rb

    def create
        @article = Article.new(params.require(:article).permit(:title, :description))
        if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sasdsdsdsadsads"], ["description", "asaddsadsadsadsadsadsad"], ["created_at", "2023-07-26 06:16:34.382734"], ["updated_at", "2023-07-26 06:16:34.382734"]]

    def update
        @article = Article.find(params[:id])
        if @article.update(params.require(:article).permit(:title, :description))
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "first titlesss"], ["updated_at", "2023-07-26 07:07:31.273143"], ["id", 1]]

    def destroy
        @article = Article.find(params[:id])
        if @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]